; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-5-3-5-268)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p3-1 - location
	p3-2 - location
	p5-3 - location
	p5-6 - location
	p2-4 - location
	p2-5 - location
	p1-2 - location
	p6-1 - location
	p0-3 - location
	)
	(:init
	(at driver1 s3)
	(at driver2 s0)
	(at driver3 s1)
	(at driver4 s5)
	(at driver5 s3)
	(at truck1 s5)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s3)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s1)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at package1 s2)
	(at package2 s1)
	(at package3 s1)
	(at package4 s2)
	(at package5 s2)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(= (time-to-walk s3 p3-1) 3)
	(= (time-to-walk p3-1 s3) 3)
	(= (time-to-walk s1 p3-1) 1)
	(= (time-to-walk p3-1 s1) 1)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(= (time-to-walk s3 p3-2) 4)
	(= (time-to-walk p3-2 s3) 4)
	(= (time-to-walk s2 p3-2) 3)
	(= (time-to-walk p3-2 s2) 3)
	(path s5 p5-3)
	(path p5-3 s5)
	(path s3 p5-3)
	(path p5-3 s3)
	(= (time-to-walk s5 p5-3) 4)
	(= (time-to-walk p5-3 s5) 4)
	(= (time-to-walk s3 p5-3) 3)
	(= (time-to-walk p5-3 s3) 3)
	(path s5 p5-6)
	(path p5-6 s5)
	(path s6 p5-6)
	(path p5-6 s6)
	(= (time-to-walk s5 p5-6) 3)
	(= (time-to-walk p5-6 s5) 3)
	(= (time-to-walk s6 p5-6) 5)
	(= (time-to-walk p5-6 s6) 5)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(= (time-to-walk s2 p2-4) 4)
	(= (time-to-walk p2-4 s2) 4)
	(= (time-to-walk s4 p2-4) 2)
	(= (time-to-walk p2-4 s4) 2)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(= (time-to-walk s2 p2-5) 4)
	(= (time-to-walk p2-5 s2) 4)
	(= (time-to-walk s5 p2-5) 2)
	(= (time-to-walk p2-5 s5) 2)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 3)
	(= (time-to-walk p1-2 s1) 3)
	(= (time-to-walk s2 p1-2) 1)
	(= (time-to-walk p1-2 s2) 1)
	(path s6 p6-1)
	(path p6-1 s6)
	(path s1 p6-1)
	(path p6-1 s1)
	(= (time-to-walk s6 p6-1) 2)
	(= (time-to-walk p6-1 s6) 2)
	(= (time-to-walk s1 p6-1) 5)
	(= (time-to-walk p6-1 s1) 5)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(= (time-to-walk s0 p0-3) 3)
	(= (time-to-walk p0-3 s0) 3)
	(= (time-to-walk s3 p0-3) 1)
	(= (time-to-walk p0-3 s3) 1)
	(link s5 s3)
	(link s3 s5)
	(= (time-to-drive s5 s3) 5)
	(= (time-to-drive s3 s5) 5)
	(link s5 s6)
	(link s6 s5)
	(= (time-to-drive s5 s6) 1)
	(= (time-to-drive s6 s5) 1)
	(link s6 s0)
	(link s0 s6)
	(= (time-to-drive s6 s0) 3)
	(= (time-to-drive s0 s6) 3)
	(link s1 s6)
	(link s6 s1)
	(= (time-to-drive s1 s6) 2)
	(= (time-to-drive s6 s1) 2)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 5)
	(= (time-to-drive s1 s4) 5)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 4)
	(= (time-to-drive s5 s4) 4)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 5)
	(= (time-to-drive s1 s0) 5)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 1)
	(= (time-to-drive s2 s0) 1)
	(link s0 s5)
	(link s5 s0)
	(= (time-to-drive s0 s5) 5)
	(= (time-to-drive s5 s0) 5)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 1)
	(= (time-to-drive s0 s3) 1)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 4)
	(= (time-to-drive s1 s3) 4)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 5)
	(= (time-to-drive s4 s3) 5)
	(link s3 s6)
	(link s6 s3)
	(= (time-to-drive s3 s6) 3)
	(= (time-to-drive s6 s3) 3)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 1)
	(= (time-to-drive s1 s2) 1)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 2)
	(= (time-to-drive s4 s2) 2)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 1)
	(= (time-to-drive s5 s2) 1)
	(link s2 s6)
	(link s6 s2)
	(= (time-to-drive s2 s6) 3)
	(= (time-to-drive s6 s2) 3)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s2)
	(at driver3 s0)
	(at driver4 s2)
	(at truck2 s3)
	(at package1 s5)
	(at package2 s0)
	(at package3 s0)
	(at package4 s0)
	(at package5 s2)
	))

(:metric minimize (+ (* 3 (total-time)) (* 4 (fuel-used))))

)

; plan
1. (board-truck driver4 truck1 s5)
   deleted: (at driver4 s5) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 2 of 9
2. (walk driver1 s3 p3-2)
   deleted: (at driver1 s3)
   added: (at driver1 p3-2)
   goals met: 2 of 9
3. (walk driver1 p3-2 s2)
   deleted: (at driver1 p3-2)
   added: (at driver1 s2)
   goals met: 3 of 9
4. (board-truck driver3 truck3 s1)
   deleted: (at driver3 s1) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 3 of 9
5. (load-truck package2 truck3 s1)
   deleted: (at package2 s1)
   added: (in package2 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 3 of 9
6. (load-truck package3 truck3 s1)
   deleted: (at package3 s1)
   added: (in package3 truck3)
   changed: (load truck3) from 1 to 2, (fuel-per-minute truck3) from 11 to 13
   goals met: 3 of 9
7. (drive-truck truck3 s1 s0 driver3)
   deleted: (at truck3 s1)
   added: (at truck3 s0)
   changed: (fuel-used) from 0 to 65
   goals met: 3 of 9
8. (disembark-truck driver3 truck3 s0)
   deleted: (driving driver3 truck3)
   added: (at driver3 s0) (empty truck3)
   goals met: 4 of 9
9. (unload-truck package2 truck3 s0)
   deleted: (in package2 truck3)
   added: (at package2 s0)
   changed: (load truck3) from 2 to 1, (fuel-per-minute truck3) from 13 to 11
   goals met: 5 of 9
10. (unload-truck package3 truck3 s0)
   deleted: (in package3 truck3)
   added: (at package3 s0)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 6 of 9
11. (drive-truck truck1 s5 s2 driver4)
   deleted: (at truck1 s5)
   added: (at truck1 s2)
   changed: (fuel-used) from 65 to 75
   goals met: 6 of 9
12. (load-truck package1 truck1 s2)
   deleted: (at package1 s2)
   added: (in package1 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 6 of 9
13. (load-truck package4 truck1 s2)
   deleted: (at package4 s2)
   added: (in package4 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 6 of 9
14. (drive-truck truck1 s2 s5 driver4)
   deleted: (at truck1 s2)
   added: (at truck1 s5)
   changed: (fuel-used) from 75 to 88
   goals met: 6 of 9
15. (unload-truck package1 truck1 s5)
   deleted: (in package1 truck1)
   added: (at package1 s5)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 7 of 9
16. (drive-truck truck1 s5 s0 driver4)
   deleted: (at truck1 s5)
   added: (at truck1 s0)
   changed: (fuel-used) from 88 to 143
   goals met: 7 of 9
17. (unload-truck package4 truck1 s0)
   deleted: (in package4 truck1)
   added: (at package4 s0)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 8 of 9
18. (drive-truck truck1 s0 s2 driver4)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   changed: (fuel-used) from 143 to 153
   goals met: 8 of 9
19. (disembark-truck driver4 truck1 s2)
   deleted: (driving driver4 truck1)
   added: (at driver4 s2) (empty truck1)
   goals met: 9 of 9
